model {
  ssd {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 135
        width: 180
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_edgetpu"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.9999999e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.029999999
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.97000003
          center: true
          scale: true
          epsilon: 0.001
          train: true
        }
      }
      use_depthwise: true
      override_base_feature_extractor_hyperparams: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.9999999e-05
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.029999999
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.97000003
            center: true
            scale: true
            epsilon: 0.001
            train: true
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.80000001
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        class_prediction_bias_init: -4.5999999
        use_depthwise: true
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.94999999
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.33329999
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 0.30000001
        iou_threshold: 0.60000002
        max_detections_per_class: 30
        max_total_detections: 30
        use_static_shapes: true
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
      localization_loss {
        weighted_smooth_l1 {
          delta: 1.0
        }
      }
      classification_loss {
        weighted_sigmoid_focal {
          gamma: 2.0
          alpha: 0.75
        }
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}
train_config {
  batch_size: 32
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_rotation90 {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
    }
  }
  data_augmentation_options {
    random_adjust_contrast {
    }
  }
  data_augmentation_options {
    random_adjust_hue {
    }
  }
  data_augmentation_options {
    random_rgb_to_gray {
      probability: 0.2
    }
  }
  sync_replicas: true
  optimizer {
    adam_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.00079999998
          decay_steps: 30000
          staircase: false
          min_learning_rate: 1e-06
        }
      }
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "training/mobnet3_edge/model/model.ckpt"
  from_detection_checkpoint: true
  num_steps: 400000
  startup_delay_steps: 0.0
  replicas_to_aggregate: 32
  load_all_detection_checkpoint_vars: true
  max_number_of_boxes: 30
  unpad_groundtruth_tensors: false
}
train_input_reader {
  label_map_path: "training/mobnet3_edge/label_map_one.pbtxt"
  tf_record_input_reader {
    input_path: "training/mobnet3_edge/data/train.record"
  }
}
eval_config {
  num_visualizations: 60
  num_examples: 900
  eval_interval_secs: 1800
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "training/mobnet3_edge/label_map_one.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "training/mobnet3_edge/data/val.record"
  }
}
graph_rewriter {
  quantization {
    delay: 30000
    weight_bits: 8
    activation_bits: 8
  }
}
